# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
brew 'less'

# Install some other useful utilities like `sponge`
brew 'moreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils'

# Install GNU `sed`, overwriting the built-in `sed`
brew 'gnu-sed'

# Install Bash 4
# Note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before running `chsh`.
brew 'bash'
# Install Bash completion
brew 'bash-completion@2'

# Install useful completions
brew 'brew-cask-completion'
# brew 'composer-completion'
brew 'gem-completion'
brew 'launchctl-completion'
brew 'open-completion'
brew 'ruby-completion'
brew 'yarn-completion'

# Install more recent versions of some OS X tools
brew 'vim'

brew 'grep'
brew 'screen'
brew 'zlib'

# Install other useful binaries
brew 'ack'
brew 'aria2'
brew 'awk'
brew 'awscli'
brew 'bat'
brew 'bfg'
brew 'cloc'
brew 'cmake'
brew 'csvkit'
brew 'ctags'
brew 'diff-so-fancy'
brew 'docker-compose'
brew 'dust'
brew 'exa'
brew 'fzf'
brew 'gcc'
brew 'gh'
brew 'ghex'
brew 'git'
brew 'git-standup'
brew 'git-quick-stats'
brew 'glow'
brew 'gnupg'
brew 'go'
brew 'goaccess'
brew 'graphviz'
brew 'grip'
brew 'httpie'
brew 'htop-osx'
brew 'jp2a'
brew 'jpegoptim'
brew 'jq'
brew 'jrnl'
brew 'jsonlint'
brew 'tdewolff/tap/minify'
brew 'node' # This installs `npm` too using the recommended installation method
brew 'openjdk'
brew 'openssl@1.1'
brew 'optipng'
brew 'p7zip'
brew 'pigz'
brew 'postgresql'
brew 'pv'
brew 'python3'
brew 'rbenv'
brew 'rbenv-binstubs'
brew 'rename'
brew 'ssh-copy-id', link: true
brew 'subliminal'
brew 'terraform'
brew 'terraform-docs'
brew 'titlecase'
brew 'tldr'
brew 'tree'
brew 'unar'
brew 'webkit2png'
brew 'wget', ags: ['with-iri']
brew 'yamllint'
brew 'yarn'
brew 'youtube-dl'
brew 'zopfli'

# Install Brew Cask along with Desktop apps
tap 'homebrew/cask'
# SVN is a prerequisite for installing fonts from Homebrew
brew 'svn'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

cask '1password-beta'
cask '1password-cli'
cask 'docker'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'google-chrome'
cask 'haptickey'
cask 'hey'
cask 'iterm2-beta'
cask 'kindle'
cask 'licecap'
cask 'meetingbar'
cask 'pocket-casts'
cask 'rescuetime'
cask 'screenflick'
cask 'slack-beta'
cask 'tableplus'
cask 'tabula'
cask 'telegram-desktop-beta'
cask 'vlc-nightly'
cask 'visual-studio-code'
cask 'zoom'

# Quick Look plugins
# See https://github.com/sindresorhus/quick-look-plugins
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'

# Mac App Store apps
# Install mas cli for these to work
# https://github.com/mas-cli/mas
mas "AntiRSI", id: 442007571
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "The Unarchiver", id: 425424353
